                {
                    "instructions": [
                        "Hello! Welcome to Dracula's Castle. You have been dragged here by Dracula's minions to be a feast for his monsters.\n Try to escape the monsters or if your brave kill them! But make sure your quick or the monsters will get you! Press start to begin your escape!"
                    ],
                    "room introduction": {
                        "wolf": {
                            "room1": [
                                "You wake up in a room with a pair of glowing eyes staring at you. A wolf is in front of you and it looks hungry.\n In the room you see a broken mirror, a door, and a small opening in the flooring"
                            ],
                            "room2": [
                                "You enter a room and a man is inside surrounded by a pack of wolves. He looks at you and says 'Help me!' \n In the room you see a lantern, a sword in a case, and the wolves turning towards you."
                            ],
                            "room3": [
                                "You reach the top of the stairs and see a wolf resting in the moonlight. It spots you and slowly approaches growling. \n Theres a large open window, an axe hanging on the wall, and a large wooden door."
                            ]
                        },
                        "zombie": {
                            "room1": [
                                "You wake up in a room and hear an awful groan. A zombie is in front of you and it looks hungry.\n In the room you see a broken mirror, a door, and a small opening in the flooring"
                            ],
                            "room2": [
                                "You enter a room and a man is inside surrounded by a pack of zombies. He looks at you and says 'Help me!' \n In the room you see a lantern, a sword in a case, and the zombies turning towards you."
                            ],
                            "room3": [
                                "You reach the top of the stairs and see a zombie tearing into a corpse. It spots you and slowly approaches. \n Theres a large open window, an axe hanging on the wall, and a large wooden door"
                            ]
                        },
                        "spider": {
                            "room1": [
                                "You wake up in a room with a pair of glowing eyes staring at you. A wolf is in front of you and it looks hungry.\n In the room you see a broken mirror, a door, and a small opening in the flooring"
                            ],
                            "room2": [
                                "You enter a room and a man is inside surrounded by 3 massive spiders. It smells like fuel. He looks at you and says 'Help me!' \n In the room you see a lantern, a sword in a case, and the spiders turning towards you."
                            ],
                            "room3": [
                                "You reach the top of the stairs and see a huge spider in its web. It spots you and slowly approaches hissing. \n Theres a large open window, an axe hanging on the wall, and a large wooden door"
                            ]
                        },
                        "dracula": [
                            "You open the door and see Dracula standing in the middle of a large library. He looks at you and says 'I'm going to make a meal of you!'\n In the room you see a table with a broken leg, another large window, and dracula drawing out his fangs to lunge towards you"
                        ]
                    },
                    "buttons": {
                        "attack": {
                            "room1": "Grab the piece of broken glass",
                            "room2": "Jump towards the lantern",
                            "room3": "Leap for the axe",
                            "room4": "Cut the table leg into a stake"
                        },
                        "escape": {
                            "room1": "Run to the door",
                            "room2": "Leave him",
                            "room3": "Jump out the window",
                            "room4": "Submit your life to Dracula and become his servant"
                        },
                        "die": {
                            "room1": "Jump into hole",
                            "room2": "Run to for the sword",
                            "room3": "Sprint towards the door",
                            "room4": "Jump out the window"
                        }
                    },
                    "action consequences": {
                        "room1": {
                            "wolf": {
                                "attack/survive": [
                                    "You stab the wolf in its heart before it sinks in its teeth. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "escape": [
                                    "You barely escape the jaws of the beast. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "attack/die": [
                                    "The wolf sinks its teeth into your neck."
                                ],
                                "die": [
                                    "You fall into a pit of spikes."
                                ]
                            },
                            "spider": {
                                "attack/survive": [
                                    "You stab the spider in its abdomen before it sinks in its teeth. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "escape": [
                                    "You barely escape the jaws of the beast. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "attack/die": [
                                    "The spider wraps you into a cacoon and feasts on your body."
                                ],
                                "die": [
                                    "You fall into a pit of spikes"
                                ]
                            },
                            "zombie": {
                                "attack/survive": [
                                    "You cut the zombie's head off before it sinks in its teeth. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "escape": [
                                    "You barely escape the zombie's grasp. You are safe for now and cross\n the hall to inspect the next room for exits."
                                ],
                                "attack/die": [
                                    "The zombie eats your brains."
                                ],
                                "die": [
                                    "You fall into a pit of spikes"
                                ]
                            }
                        },
                        "room2": {
                            "wolf": {
                                "attack/survive": [
                                    "You throw the lantern at the feet of the wolves and a fire erupts across the floor.\n The man and the wolves become engulfed in flames while you crawl out the door.\n You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "escape": [
                                    "You close the door and hear the man torn apart. You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "attack/die": [
                                    "You throw the lantern at the feet of the wolves and a fire erupts across the floor. You become engulfed in flames."
                                ],
                                "die": [
                                    "The wolves are too fast. You are torn apart with the man"
                                ]
                            },
                            "spider": {
                                "attack/survive": [
                                    "You throw the lantern at the feet of the spiders and a fire erupts across the floor.\n The man and the spiders become engulfed in flames while you crawl out the door.\n You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "escape": [
                                    "You close the door and hear the man torn apart. You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "attack/die": [
                                    "You throw the lantern at the feet of the spiders and a fire erupts across the floor. You become engulfed in flames."
                                ],
                                "die": [
                                    "The spiders shoot you with a web. You're stuck to the case while the spiders feast on you."
                                ]
                            },
                            "zombie": {
                                "attack/survive": [
                                    "You throw the lantern at the feet of the zombies and a fire erupts across the floor.\n The man and the zombies become engulfed in flames while you crawl out the door.\n You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "escape": [
                                    "You close the door and hear the man torn apart. You are safe for now and see a tall staircase leading upstairs."
                                ],
                                "attack/die": [
                                    "You throw the lantern at the feet of the zombies and a fire erupts across the floor. You become engulfed in flames."
                                ],
                                "die": [
                                    "The case is locked. The zombies surround and eat you."
                                ]
                            }
                        },
                        "room3": {
                            "wolf": {
                                "attack/survive": [
                                    "The axe cuts through the wolf's skull. You are safe for now and approach the large wooden door."
                                ],
                                "escape": [
                                    "You jump out the window and grab hold of a thick vine hanging from the wall. The wolf follows and falls to its death.\n You are safe for now and approach the large wooden door."
                                ],
                                "attack/die": [
                                    "The wolf pounces on you before you can get to the axe and rips out your innards."
                                ],
                                "die": [
                                    "The wolf snaps your neck before you can get to the door."
                                ]
                            },
                            "spider": {
                                "attack/survive": [
                                    "The axe cuts through the spider's abdomen. You are safe for now and approach the large wooden door."
                                ],
                                "escape": [
                                    "You jump out the window and grab hold of a thick vine hanging from the wall. The spider follows and falls to its death.\n You are safe for now and approach the large wooden door."
                                ],
                                "attack/die": [
                                    "The spider pounces on you before you can get to the axe and rips out your innards."
                                ],
                                "die": [
                                    "You trip and fall into the spider's web. The spider injects you with its venom."
                                ]
                            },
                            "zombie": {
                                "attack/survive": [
                                    "The axe cuts the zombie in two. You are safe for now and approach the large wooden door."
                                ],
                                "escape": [
                                    "You jump out the window and grab hold of a thick vine hanging from the wall. The zombie follows and falls to its death.\n You are safe for now and approach the large wooden door."
                                ],
                                "attack/die": [
                                    "You trip before you can get to the axe and the zombie rips out your innards."
                                ],
                                "die": [
                                    "The zombie bites your ankkle and you fall to the ground. you get eaten alive."
                                ]
                            }
                        },
                        "dracula": {
                            "attack/survive": [
                                "You snap off the table leg and stick Dracula in the heart. He screams and turns to dust.\n You have defeated Dracula and his minions!"
                            ],
                            "escape": [
                                "You submit to Dracula and he turns you into his servant. You are now a vampire and have become one of his minions."
                            ],
                            "attack/die": [
                                "Dracula sees your plan and Takes hold of the stake. He sinks his fangs into your neck and become his servant."
                            ],
                            "die": [
                                "Dracula sinks his teeth into your neck and you become his servant. You are now a vampire and have become one of his minions."
                            ]
                        }
                    }
                }
